Revit 2027 API
CableSize.Duplicate Method
 Duplicates this Cable Size.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CableSize Duplicate()
Public Function Duplicate As CableSize
public:
CableSize^ Duplicate()
member Duplicate : unit -> CableSize
Return Value
CableSize
 The duplicated Cable Size data.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace